In [2]:
import numpy as np # linear algebra
import pandas as pd # data processing, CSV file I/O (e.g. pd.read_csv)
import matplotlib.pyplot as plt
import time
import math
import seaborn as sns
%matplotlib inline

# Input data files are available in the "../input/" directory.
# For example, running this (by clicking run or pressing Shift+Enter) will list the files in the input directory

In [3]:
from google.colab import files
uploaded = files.upload()

Saving train.csv to train.csv
Saving test.csv to test.csv

In [45]:
train = pd.read_csv("train.csv")
train.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [46]:
test = pd.read_csv("test.csv")
test.head()

   PassengerId  Pclass  ... Cabin Embarked
0          892       3  ...   NaN        Q
1          893       3  ...   NaN        S
2          894       2  ...   NaN        Q
3          895       3  ...   NaN        S
4          896       3  ...   NaN        S

[5 rows x 11 columns]

In [47]:
data = pd.concat([train, test], sort = False)
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1309 entries, 0 to 417
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  1309 non-null   int64
 1   Survived     891 non-null    float64
 2   Pclass       1309 non-null   int64
 3   Name         1309 non-null   object
 4   Sex          1309 non-null   object
 5   Age          1046 non-null   float64
 6   SibSp        1309 non-null   int64
 7   Parch        1309 non-null   int64
 8   Ticket       1309 non-null   object
 9   Fare         1308 non-null   float64
 10  Cabin        295 non-null    object
 11  Embarked     1307 non-null   object
dtypes: float64(3), int64(4), object(5)
memory usage: 132.9+ KB

In [48]:
data['Age'] = data['Age'].fillna(value=data['Age'].median())
data['Fare'] = data['Fare'].fillna(value=data['Fare'].median())

In [49]:
data['Embarked'] = data['Embarked'].fillna('S')
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1309 entries, 0 to 417
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  1309 non-null   int64
 1   Survived     891 non-null    float64
 2   Pclass       1309 non-null   int64
 3   Name         1309 non-null   object
 4   Sex          1309 non-null   object
 5   Age          1309 non-null   float64
 6   SibSp        1309 non-null   int64
 7   Parch        1309 non-null   int64
 8   Ticket       1309 non-null   object
 9   Fare         1309 non-null   float64
 10  Cabin        295 non-null    object
 11  Embarked     1309 non-null   object
dtypes: float64(3), int64(4), object(5)
memory usage: 132.9+ KB

In [50]:
data.loc[ data['Age'] <= 16, 'Age'] = 0
data.loc[(data['Age'] > 16) & (data['Age'] <= 32), 'Age'] = 1
data.loc[(data['Age'] > 32) & (data['Age'] <= 48), 'Age'] = 2
data.loc[(data['Age'] > 48) & (data['Age'] <= 64), 'Age'] = 3
data.loc[ data['Age'] > 64, 'Age'] = 4

In [51]:
import re
def get_title(name):
    title_search = re.search(' ([A-Za-z]+\.)', name)
    
    if title_search:
        return title_search.group(1)
    return ""

In [52]:
data['Title'] = data['Name'].apply(get_title)
data['Title'].value_counts()

Mr.          757
Miss.        260
Mrs.         197
Master.       61
Dr.            8
Rev.           8
Col.           4
Ms.            2
Major.         2
Mlle.          2
Mme.           1
Countess.      1
Sir.           1
Capt.          1
Jonkheer.      1
Lady.          1
Don.           1
Dona.          1
Name: Title, dtype: int64

In [53]:
data['Title'] = data['Title'].replace(['Capt.', 'Dr.', 'Major.', 'Rev.'], 'Officer.')
data['Title'] = data['Title'].replace(['Lady.', 'Countess.', 'Don.', 'Sir.', 'Jonkheer.', 'Dona.'], 'Royal.')
data['Title'] = data['Title'].replace(['Mlle.', 'Ms.'], 'Miss.')
data['Title'] = data['Title'].replace(['Mme.'], 'Mrs.')
data['Title'].value_counts()

Mr.         757
Miss.       264
Mrs.        198
Master.      61
Officer.     19
Royal.        6
Col.          4
Name: Title, dtype: int64

In [54]:
data['Cabin'] = data['Cabin'].fillna('Missing')
data['Cabin'] = data['Cabin'].str[0]
data['Cabin'].value_counts()

M    1014
C      94
B      65
D      46
E      41
A      22
F      21
G       5
T       1
Name: Cabin, dtype: int64

In [55]:
data['Family_Size'] = data['SibSp'] + data['Parch'] + 1
data['IsAlone'] = 0
data.loc[data['Family_Size']==1, 'IsAlone'] = 1
data.head()

   PassengerId  Survived  Pclass  ...  Title Family_Size  IsAlone
0            1       0.0       3  ...    Mr.           2        0
1            2       1.0       1  ...   Mrs.           2        0
2            3       1.0       3  ...  Miss.           1        1
3            4       1.0       1  ...   Mrs.           2        0
4            5       0.0       3  ...    Mr.           1        1

[5 rows x 15 columns]

In [56]:
final = data.drop(['Name', 'Ticket'], axis = 1)
final.head()

   PassengerId  Survived  Pclass     Sex  ...  Embarked  Title  Family_Size  IsAlone
0            1       0.0       3    male  ...         S    Mr.            2        0
1            2       1.0       1  female  ...         C   Mrs.            2        0
2            3       1.0       3  female  ...         S  Miss.            1        1
3            4       1.0       1  female  ...         S   Mrs.            2        0
4            5       0.0       3    male  ...         S    Mr.            1        1

[5 rows x 13 columns]

In [57]:
dummies = pd.get_dummies(final, drop_first = True)
dummies.head()

   PassengerId  Survived  Pclass  ...  Title_Mrs.  Title_Officer.  Title_Royal.
0            1       0.0       3  ...           0               0             0
1            2       1.0       1  ...           1               0             0
2            3       1.0       3  ...           0               0             0
3            4       1.0       1  ...           1               0             0
4            5       0.0       3  ...           0               0             0

[5 rows x 26 columns]

In [58]:
all_train = dummies[dummies['Survived'].notna()]
all_train.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 891 entries, 0 to 890
Data columns (total 26 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   PassengerId     891 non-null    int64
 1   Survived        891 non-null    float64
 2   Pclass          891 non-null    int64
 3   Age             891 non-null    float64
 4   SibSp           891 non-null    int64
 5   Parch           891 non-null    int64
 6   Fare            891 non-null    float64
 7   Family_Size     891 non-null    int64
 8   IsAlone         891 non-null    int64
 9   Sex_male        891 non-null    uint8
 10  Cabin_B         891 non-null    uint8
 11  Cabin_C         891 non-null    uint8
 12  Cabin_D         891 non-null    uint8
 13  Cabin_E         891 non-null    uint8
 14  Cabin_F         891 non-null    uint8
 15  Cabin_G         891 non-null    uint8
 16  Cabin_M         891 non-null    uint8
 17  Cabin_T         891 non-null    uint8
 18  Embarked_Q      891 non-null    uint8
 19  Embarked_S      891 non-null    uint8
 20  Title_Master.   891 non-null    uint8
 21  Title_Miss.     891 non-null    uint8
 22  Title_Mr.       891 non-null    uint8
 23  Title_Mrs.      891 non-null    uint8
 24  Title_Officer.  891 non-null    uint8
 25  Title_Royal.    891 non-null    uint8
dtypes: float64(3), int64(6), uint8(17)
memory usage: 84.4 KB

In [68]:
all_test = dummies[dummies['Survived'].isna()]
all_test.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 418 entries, 0 to 417
Data columns (total 26 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   PassengerId     418 non-null    int64
 1   Survived        0 non-null      float64
 2   Pclass          418 non-null    int64
 3   Age             418 non-null    float64
 4   SibSp           418 non-null    int64
 5   Parch           418 non-null    int64
 6   Fare            418 non-null    float64
 7   Family_Size     418 non-null    int64
 8   IsAlone         418 non-null    int64
 9   Sex_male        418 non-null    uint8
 10  Cabin_B         418 non-null    uint8
 11  Cabin_C         418 non-null    uint8
 12  Cabin_D         418 non-null    uint8
 13  Cabin_E         418 non-null    uint8
 14  Cabin_F         418 non-null    uint8
 15  Cabin_G         418 non-null    uint8
 16  Cabin_M         418 non-null    uint8
 17  Cabin_T         418 non-null    uint8
 18  Embarked_Q      418 non-null    uint8
 19  Embarked_S      418 non-null    uint8
 20  Title_Master.   418 non-null    uint8
 21  Title_Miss.     418 non-null    uint8
 22  Title_Mr.       418 non-null    uint8
 23  Title_Mrs.      418 non-null    uint8
 24  Title_Officer.  418 non-null    uint8
 25  Title_Royal.    418 non-null    uint8
dtypes: float64(3), int64(6), uint8(17)
memory usage: 39.6 KB

In [69]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(all_train.drop(['PassengerId','Survived'],axis=1), 
                                                    all_train['Survived'], test_size=0.30, 
                                                    random_state=101)

In [70]:
from sklearn.linear_model import LogisticRegression

In [71]:
model = LogisticRegression(solver = 'liblinear')
model.fit(X_train,y_train)

LogisticRegression(C=1.0, class_weight=None, dual=False, fit_intercept=True,
                   intercept_scaling=1, l1_ratio=None, max_iter=100,
                   multi_class='auto', n_jobs=None, penalty='l2',
                   random_state=None, solver='liblinear', tol=0.0001, verbose=0,
                   warm_start=False)

In [72]:
predictions = model.predict(X_test)
predictions

array([0., 1., 1., 1., 0., 0., 0., 0., 1., 1., 0., 0., 1., 0., 0., 0., 0.,
       0., 0., 1., 0., 0., 1., 1., 0., 0., 0., 0., 0., 0., 1., 1., 1., 0.,
       0., 1., 0., 0., 0., 1., 0., 1., 1., 0., 0., 0., 0., 0., 0., 0., 1.,
       0., 1., 1., 1., 0., 0., 0., 0., 1., 1., 0., 0., 1., 0., 0., 1., 1.,
       1., 0., 0., 0., 0., 0., 1., 1., 0., 0., 0., 0., 0., 1., 0., 0., 1.,
       0., 0., 1., 0., 1., 0., 1., 1., 1., 1., 1., 1., 0., 0., 1., 0., 1.,
       0., 0., 1., 1., 1., 1., 1., 0., 0., 0., 0., 0., 1., 0., 1., 0., 0.,
       1., 0., 0., 1., 0., 0., 0., 0., 0., 1., 0., 1., 1., 1., 0., 0., 0.,
       0., 0., 0., 1., 0., 1., 0., 0., 1., 0., 1., 0., 0., 0., 1., 1., 0.,
       0., 0., 1., 1., 0., 1., 1., 0., 0., 0., 0., 1., 1., 0., 1., 0., 0.,
       1., 0., 0., 1., 0., 0., 1., 0., 0., 0., 0., 0., 1., 1., 1., 0., 0.,
       1., 0., 0., 0., 0., 0., 1., 1., 0., 0., 1., 0., 0., 0., 0., 0., 1.,
       0., 1., 0., 1., 1., 0., 0., 0., 0., 0., 0., 0., 0., 1., 0., 1., 1.,
       1., 0., 0., 0., 1., 0., 0., 0., 0., 1., 0., 1., 1., 1., 0., 0., 1.,
       1., 0., 0., 1., 0., 0., 1., 1., 0., 0., 1., 0., 0., 1., 0., 0., 0.,
       0., 0., 0., 1., 0., 0., 1., 1., 0., 1., 1., 0., 1.])

In [73]:
from sklearn.metrics import classification_report
print(classification_report(y_test,predictions))

              precision    recall  f1-score   support

         0.0       0.81      0.88      0.84       154
         1.0       0.81      0.73      0.77       114

    accuracy                           0.81       268
   macro avg       0.81      0.80      0.81       268
weighted avg       0.81      0.81      0.81       268

In [74]:
from sklearn.metrics import confusion_matrix
confusion_matrix(y_test,predictions)

array([[135,  19],
       [ 31,  83]])

In [75]:
all_test.head()

   PassengerId  Survived  Pclass  ...  Title_Mrs.  Title_Officer.  Title_Royal.
0          892       NaN       3  ...           0               0             0
1          893       NaN       3  ...           1               0             0
2          894       NaN       2  ...           0               0             0
3          895       NaN       3  ...           0               0             0
4          896       NaN       3  ...           1               0             0

[5 rows x 26 columns]

In [76]:
test_Pred = all_test.drop(['PassengerId', 'Survived'], axis = 1)

In [77]:
test_Pred.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 418 entries, 0 to 417
Data columns (total 24 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Pclass          418 non-null    int64
 1   Age             418 non-null    float64
 2   SibSp           418 non-null    int64
 3   Parch           418 non-null    int64
 4   Fare            418 non-null    float64
 5   Family_Size     418 non-null    int64
 6   IsAlone         418 non-null    int64
 7   Sex_male        418 non-null    uint8
 8   Cabin_B         418 non-null    uint8
 9   Cabin_C         418 non-null    uint8
 10  Cabin_D         418 non-null    uint8
 11  Cabin_E         418 non-null    uint8
 12  Cabin_F         418 non-null    uint8
 13  Cabin_G         418 non-null    uint8
 14  Cabin_M         418 non-null    uint8
 15  Cabin_T         418 non-null    uint8
 16  Embarked_Q      418 non-null    uint8
 17  Embarked_S      418 non-null    uint8
 18  Title_Master.   418 non-null    uint8
 19  Title_Miss.     418 non-null    uint8
 20  Title_Mr.       418 non-null    uint8
 21  Title_Mrs.      418 non-null    uint8
 22  Title_Officer.  418 non-null    uint8
 23  Title_Royal.    418 non-null    uint8
dtypes: float64(2), int64(5), uint8(17)
memory usage: 33.1 KB

In [78]:
t_pred = model.predict(test_Pred).astype(int)

In [79]:
PassengerId = all_test['PassengerId']

In [80]:
logSub = pd.DataFrame({'PassengerId': PassengerId, 'Survived':t_pred })
logSub.head()

   PassengerId  Survived
0          892         0
1          893         1
2          894         0
3          895         0
4          896         1

In [81]:
logSub.to_csv("Logistics_Regression_Submission.csv", index = False)